Ambi.Rus.Config.notify_type = 2
Ambi.Rus.Config.nextxp_multiply = 1000

-- ------------------------------------------------------------------------------------------
AMB.Rus.Config.entities_blacklist = {
    [ 'edit_fog' ] = true,
    [ 'edit_sky' ] = true,
    [ 'edit_sun' ] = true,

    [ 'sent_skycamera_editor' ] = true,
    [ 'sent_skybox_editor' ] = true,
    [ 'lua_run' ] = true,
    [ 'sent_ball' ] = true,
}

-- ------------------------------------------------------------------------------------------
AMB.Rus.Config.bot_names = {}
AMB.Rus.Config.bot_names[ 1 ] = {
    'Мария',
    'Галина',
    'Валентина',
    'Валерия',
    'Наталья',
    'Александра',
    'Любовь',
    'Надежда',
    'Елена',
    'Тамара',
    'Евгения',
    'Клаудия',
    'Зинаида',
    'Василиса',
    'Анна',
    'Анастасия',
    'Нина',
    'Лилия',
    'Эвелина',
    'Ольга',
    'Татьяна',
    'Елена',
    'Светлана',
    'Кристина',
    'Маргариста',
    'Ирина',
    'Лариса'
}
AMB.Rus.Config.bot_names[ 2 ] = {
    'Брусничнива',
    'Экстрадиповна',
    'Оксидовна',
    'Ивановна',
    'Васильевна',
    'Вячеславовна',
    'Анатольевна',
    'Михайловна',
    'Николаевна',
    'Алексеевна',
    'Григорьевна',
    'Викторовна',
    'Игнатьевна',
    'Сысоевна',
    'Сергеевна',
    'Пантелеевна',
    'Андреевна',
    'Мариновна',
    'Игоревна'
}