local Defense, Config = Ambi.General.CreateModule( 'Defense' )

-- ------------------------------------------------------------------------------------------------------------------------------------
Config.enable = true -- Вкл/Выкл Глобальную Защиту
Config.check_dont_work_on_superadmins = false -- Проверки не будут срабатывать на супер админ ранги?
Config.punishment_dont_work_on_superadmins = false -- При неудачной проверки, наказание не будут срабатывать на супер админ ранги?
Config.superadmins = { -- Ранги, у которых будет доступ к настройкам и полным логам защиты
    [ 'superadmin' ] = true,
    [ 'owner' ] = true,
    [ 'founder' ] = true,
    [ 'root' ] = true
}
Config.admins = { -- Ранги, у которых будет доступ к некоторым логам
    [ 'admin' ] = true,
}

-- ------------------------------------------------------------------------------------------------------------------------------------
Config.ban_replace = false -- Заменить Defense бан на системы из популярных админок (ULX, SAM, ServerGuard, BAdmin)
Config.ban_time = 4000 -- Бан в минутах. Работает только для 3 типа наказания
Config.ban_reason = 'Подозрение в Читерстве!' -- Причина бана. Подробная причина будет показываться админам