--[[-------------------------------------------------------------------------
	Обязательные методы:
		:SetPrice()
		:SetDescription()

	Популярные:
		:SetTerm()
		:SetStackable()
		:SetCategory()
		:SetIcon()
		:SetOnActivate()
		:SetNetworked()
		:SetHidden()
		:SetHighlightColor()
		:SetDiscountedFrom()

	Подробнее и все остальные:
		gm-donate.ru/docs

	Бесплатная быстрая помощь и настройка:
		gm-donate.ru/support
---------------------------------------------------------------------------]]


/************************************************************
	Разрешаем покупать отмычку только донатерам (DarkRP)
	Доступ навсегда за 1 рубль
	https://img.qweqwe.ovh/1493244432112.png -- частичное объяснение
************************************************************/

-- IGS("Отмычка", "otmichka") -- второй параметр не должен(!) повторяться с другими предметами
-- 	:SetPrice(1) -- 1 рубль

-- 	-- 0 - одноразовое (Т.е. купил, выполнилось OnActivate и забыл. Полезно для валюты)
-- 	-- 30 - месяц, 7 - неделя и т.д. :SetPerma() - навсегда
-- 	:SetTerm(30)

-- 	:SetDarkRPItem("lockpick") -- реальный класс энтити
-- 	:SetDescription("Разрешает вам покупать отмычку") -- описание
-- 	:SetCategory("Оружие") -- категория

-- 	-- квадратная ИКОНКА (Не обязательно). Отобразится на главной странице. Может быть с прозрачностью
-- 	:SetIcon("http://i.imgur.com/4zfVs9s.png")

-- 	-- БАННЕР 1000х400 (Не обязательно). Отобразится в подробностях итема
-- 	:SetImage("http://i.imgur.com/RqsP5nP.png")



/************************************************************
	Игровая валюта для DarkRP
	Здесь SetTerm не обязателен, т.к. срок ни на что не влияет
	Обратите внимание, цена указана третьим параметром. Так тоже можно
************************************************************/
-- IGS("100 тысяч", "100k_deneg", 200):SetDarkRPMoney(100000)
-- IGS("500 тысяч", "500k_deneg", 450):SetDarkRPMoney(500000)



/************************************************************
	Доступ к DarkRP профессиям
************************************************************/
-- IGS("Бомж", "team_hobo")
-- 	:SetDarkRPTeams("hobo") -- одна тима (command)
-- 	:SetCategory("Доступ к работам")
-- 	:SetDescription("Вы сможете месяц работать бомжом :)")
-- 	:SetPrice(50)
-- 	:SetTerm(30)

-- IGS("Продвинутые воры", "team_thieves")
-- 	:SetDarkRPTeams("advthief", "ultrathief") -- можно несколько
-- 	:SetCategory("Доступ к работам")
-- 	:SetDescription("Вам станут доступны работы продвинутого и ультравора")
-- 	:SetPrice(200)
-- 	:SetTerm(30)



/************************************************************
	Донат группы ULX
************************************************************/
IGS("VIP", "vip_month"):SetULXGroup("vip_d")
:SetPrice(49)
:SetTerm(0)
:SetCategory("Привилегии/Должности")
:SetDescription("[1] Увеличен лимит пропов до 9999\n[2] Доступны многие инструменты\n[3] Вы просто ахуенный челик ;3")

IGS("Офицер", "officer_month"):SetULXGroup("officer_d")
:SetPrice(99)
:SetTerm(0)
:SetCategory("Привилегии/Должности")
:SetDescription("[1] Доступны админ команды\n[2] Доступен спавн всего\n[3] Вы просто ахуенный челик ;3")

IGS("Админ", "admin_month"):SetULXGroup("admin_d")
:SetPrice(199)
:SetTerm(0)
:SetCategory("Привилегии/Должности")
:SetDescription("[1] Можете банить людей да-да\n[2] Можете выдавать себе денюшку да-да\n[3] Вы просто ахуенный челик ;3")

IGS("Cоздатель", "creator_month"):SetULXGroup("avk_d")
:SetPrice(1337)
:SetTerm(0)
:SetCategory("Привилегии/Должности")
:SetDescription("Ну тут как говорится, того самого..")

-- IGS("PREMIUM навсегда", "premium_navsegda"):SetULXGroup("premium")
-- 	:SetPrice(400)
-- 	:SetPerma() -- навсегда
-- 	:SetCategory("Группы")
-- 	:SetDescription("А с этой покупкой еще офигеннее, чем с покупкой VIP")

-- IGS("Тестовая операторка", "demo_operator"):SetULXGroup("operator")
-- 	:SetPrice(30)
-- 	:SetTerm(0) -- одноразовое
-- 	:SetCategory("Группы")
-- 	:SetDescription("С этой покупкой вы можете попробовать себя в роли оператора. Права исчезнут после перезахода")



/************************************************************
	Продажа поинтов для Поинтшоп 2
	https://www.gmodstore.com/scripts/view/596
************************************************************/
-- IGS("100 донат поинтов","100_points_don", 200):SetPremiumPoints(200) -- дон поинты
-- IGS("1000 обычных поинтов","1000_points", 100):SetPoints(1000) -- обычные поинты



/************************************************************
	Продажа уровней и опыта для Leveling System
	https://github.com/vrondakis/Leveling-System
************************************************************/
IGS("100.000 Рубаксов", "100_rubaksov")
	:SetPrice(10)
	:SetDescription("Добавляет 100к Рубаксов")
	:SetOnActivate(function(pl) pl:RUB_add(999) end)


local HEAL = IGS("Аптечка", "heal_10hp", 0)
	:SetDescription("Добавляет вам 999 хп")
	:SetStackable()
	:SetHidden()
	:SetOnActivate(function(pl) pl:SetHealth(999) end)

IGS("Набор аптечек", "heal_x5", 20)
	:SetDescription("Вы получите в инвентарь 2 аптечки (999 хп)")
	:SetStackable()
	:SetItems({HEAL, HEAL}) -- вы можете использовать и разные предметы
